БухЭксп/Catalogs/CW_НастройкиКлючевыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиКлючевыхПоказателей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_КлючевыеПоказателиСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	
	Если Форма["ТаблицаОформления"].Количество() = 0 Тогда  
		НастройкиОформления = ПолучитьПустуюТаблицуОформления(Объект.ЭтоГруппа);
		Форма["ТаблицаОформления"].Загрузить(НастройкиОформления);
	КонецЕсли;   
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОформления(Форма, ТекущийОбъект) Экспорт

	Объект = Форма.Объект; 
	ЭтоГруппа = Объект.ЭтоГруппа;
	
	НоваяТаблицаОформления = ПолучитьПустуюТаблицуОформления(ЭтоГруппа);
	
	НастройкиОформления= ТекущийОбъект.НастройкиОформления.Получить();
	Если ТипЗнч(НастройкиОформления) = Тип("Структура") Тогда  
		Для каждого КлючЗначение из НастройкиОформления Цикл
			НайденаняСтрока = НоваяТаблицаОформления.Найти(КлючЗначение.Ключ, "Параметр");
			Если НайденаняСтрока <> Неопределено Тогда
				НайденаняСтрока.Значение 	= КлючЗначение.Значение;	
				НайденаняСтрока.Выбор 		= Истина;
			Конецесли;
		КонецЦикла;
	КонецЕсли;  
	
	Форма["ТаблицаОформления"].Загрузить(НоваяТаблицаОформления);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиОформления(ЭтаФорма, ТекущийОбъект) Экспорт

	НастройкиОформления = Новый Структура;
	
	НайденныеСтроки = ЭтаФорма["ТаблицаОформления"].НайтиСтроки(Новый Структура("Выбор", Истина));
	Для Каждого СтрокаСтиля из НайденныеСтроки Цикл
		НастройкиОформления.Вставить(СтрокаСтиля.Параметр, СтрокаСтиля.Значение);
	КонецЦикла;
	
	ТекущийОбъект.НастройкиОформления 	= Новый ХранилищеЗначения(НастройкиОформления);

КонецПроцедуры

Процедура ТаблицаОформленияПриИзмененииЗначения(ЭтаФорма, ТекущаяСтрока) Экспорт
	
	СоответствиеТипаПараметра = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеТипаПараметра();
	
	СтрокаТекущая = ЭтаФорма["ТаблицаОформления"].НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Выбор = (СтрокаТекущая.Значение <> СоответствиеТипаПараметра.Получить(СтрокаТекущая.Параметр));
	
	Если Не СтрокаТекущая.Выбор Тогда
		СтрокаТекущая.Значение = СоответствиеТипаПараметра.Получить(СтрокаТекущая.Параметр);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ТаблицаОформленияПриИзмененииФлага(ЭтаФорма, ТекущаяСтрока) Экспорт
	
	СоответствиеТипаПараметра = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеТипаПараметра();
	
	СтрокаТекущая = ЭтаФорма["ТаблицаОформления"].НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если Не СтрокаТекущая.Выбор Тогда
		СтрокаТекущая.Значение = СоответствиеТипаПараметра.Получить(СтрокаТекущая.Параметр);	
	КонецЕсли;
	
КонецПроцедуры 


Функция ПолучитьНастройкиКлючевыхПоказателей() Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиКлючевыхПоказателей.Ссылка КАК Ссылка,
	|	CW_НастройкиКлючевыхПоказателей.Родитель КАК Родитель,
	|	CW_НастройкиКлючевыхПоказателей.Код КАК Код,
	|	CW_НастройкиКлючевыхПоказателей.Наименование КАК Наименование,
	|	CW_НастройкиКлючевыхПоказателей.ИндексЭлемента КАК ИндексЭлемента,
	|	CW_НастройкиКлючевыхПоказателей.НастройкиОформления КАК НастройкиОформления,
	|	CW_НастройкиКлючевыхПоказателей.НастройкиУсловногоОформления КАК НастройкиУсловногоОформления,
	|	CW_НастройкиКлючевыхПоказателей.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ ВТ_Показатели
	|ИЗ
	|	Справочник.CW_НастройкиКлючевыхПоказателей КАК CW_НастройкиКлючевыхПоказателей
	|ГДЕ
	|	CW_НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И CW_НастройкиКлючевыхПоказателей.НеИспользуется = ЛОЖЬ
	|	И CW_НастройкиКлючевыхПоказателей.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", ПараметрыСеанса.ТекущийПользователь);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Показатели.Ссылка КАК Ссылка,
	|	ВТ_Показатели.Код КАК Код,
	|	ВТ_Показатели.Наименование КАК Наименование,
	|	ВТ_Показатели.ИндексЭлемента КАК ИндексЭлемента,
	|	ВТ_Показатели.НастройкиОформления КАК НастройкиОформления
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|ГДЕ
	|	ВТ_Показатели.ЭтоГруппа = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексЭлемента";
	
	РезультатГруппы = Запрос.Выполнить();   
	
	ГруппыПокзателей = Новый Соответствие; 
	мПорядокГрупп 	 = Новый Массив;
	
	Выборка = РезультатГруппы.Выбрать();
	Пока Выборка.Следующий() Цикл   
		
		СтруктураПоказателя = Новый Структура;
		СтруктураПоказателя.Вставить("Код",				Выборка.Код);
		СтруктураПоказателя.Вставить("Наименование",	Выборка.Наименование); 
		
		ДанныеСтиля = Выборка.НастройкиОформления.получить(); 
		Если ТипЗнч(ДанныеСтиля) = Тип("Структура") Тогда 
			СтруктураПоказателя.Вставить("ДанныеСтиля", ДанныеСтиля);
		КонецЕсли; 
		
		ГруппыПокзателей.Вставить(Выборка.Ссылка, СтруктураПоказателя);  
		
		мПорядокГрупп.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВТ_Показатели.Ссылка КАК Ссылка,
	|	ВТ_Показатели.Родитель КАК Родитель,
	|	ВТ_Показатели.Код КАК Код,
	|	ВТ_Показатели.Наименование КАК Наименование,
	|	ВТ_Показатели.ИндексЭлемента КАК ИндексЭлемента,
	|	ВТ_Показатели.НастройкиОформления КАК НастройкиОформления,
	|	ВТ_Показатели.НастройкиУсловногоОформления КАК НастройкиУсловногоОформления
	|ИЗ
	|	ВТ_Показатели КАК ВТ_Показатели
	|ГДЕ
	|	ВТ_Показатели.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексЭлемента";  
	
	РезультатЭлементы = Запрос.Выполнить();
	
	Показатели = Новый Соответствие;
	мПорядокПоказателей = Новый Массив;
	
	Выборка = РезультатЭлементы.Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		Если ЗначениеЗаполнено(Выборка.Родитель)
			И мПорядокГрупп.Найти(Выборка.Родитель) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоказателя = Новый Структура;
		СтруктураПоказателя.Вставить("Код", 				Выборка.Код);
		СтруктураПоказателя.Вставить("Наименование", 		Выборка.Наименование); 
		СтруктураПоказателя.Вставить("Родитель", 			Выборка.Родитель); 
		
		ДанныеСтиля = Выборка.НастройкиОформления.получить(); 
		Если ТипЗнч(ДанныеСтиля) = Тип("Структура") Тогда 
			СтруктураПоказателя.Вставить("ДанныеСтиля", ДанныеСтиля);
		КонецЕсли; 
		
		ДанныеУсловногоОформления = Выборка.НастройкиУсловногоОформления.получить(); 
		Если ТипЗнч(ДанныеСтиля) = Тип("Структура") Тогда 
			СтруктураПоказателя.Вставить("УсловноеОформление", ДанныеУсловногоОформления);
		КонецЕсли; 
		
		Показатели.Вставить(Выборка.Ссылка, СтруктураПоказателя);  
		
		мПорядокПоказателей.Добавить(Выборка.Ссылка);
		
	КонецЦикла; 
	
	КлючевыеПоказатели 	= Новый Соответствие;
	КлючевыеПоказатели.Вставить("ГруппыПокзателей", 	ГруппыПокзателей);
	КлючевыеПоказатели.Вставить("Показатели", 			Показатели);
	КлючевыеПоказатели.Вставить("ПорядокГрупп", 		Новый ФиксированныйМассив(мПорядокГрупп));
	КлючевыеПоказатели.Вставить("ПорядокПоказателей",	Новый ФиксированныйМассив(мПорядокПоказателей));
	
	Возврат КлючевыеПоказатели;
	
КонецФункции

Процедура ПолучитьЗначенияКлючевыхПоказателей(СтруктураПараметров, АдресРезультата) Экспорт

	КлючевыеПоказатели = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиКлючевыхПоказателей.Ссылка КАК Ссылка,
	|	CW_НастройкиКлючевыхПоказателей.Код КАК Код,
	|	CW_НастройкиКлючевыхПоказателей.Наименование КАК Наименование
	|ИЗ
	|	Справочник.CW_НастройкиКлючевыхПоказателей КАК CW_НастройкиКлючевыхПоказателей
	|ГДЕ
	|	CW_НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И CW_НастройкиКлючевыхПоказателей.Ссылка В(&МассивПоказателей)";  
	
	Запрос.УстановитьПараметр("Владелец", 			ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("МассивПоказателей", 	СтруктураПараметров.КлючевыеПоказатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗначениеПоказателя = Справочники.CW_НастройкиКлючевыхПоказателей.ПолучитьРезультат(Выборка.Ссылка);
		КлючевыеПоказатели.Вставить(Выборка.Ссылка, ЗначениеПоказателя);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(КлючевыеПоказатели, АдресРезультата);
	
КонецПроцедуры


Функция ПолучитьПустуюТаблицуОформления(Знач ЭтоГруппа)
	
	СоответствиеТипаПараметра = ПолучитьСоответствиеТипаПараметра();
	
	НоваяТаблицаОформления = ПустаяТаблицаОформления();  
	
	ДобавитьОсновныеЭлементыСтиля(НоваяТаблицаОформления, СоответствиеТипаПараметра); 
	
	Если ЭтоГруппа Тогда
		ДобавитьЭлементыСтиляДляГруппы(НоваяТаблицаОформления, СоответствиеТипаПараметра); 
	Иначе
		ДобавитьЭлементыСтиляДляРеквизита(НоваяТаблицаОформления, СоответствиеТипаПараметра); 
	КонецЕсли; 
	
	ДобавитьОтображениеЗаголовка(НоваяТаблицаОформления, СоответствиеТипаПараметра);

	Возврат НоваяТаблицаОформления;

КонецФункции  

Функция ПолучитьПустуюТаблицуУсловногоОформления() Экспорт
	
	СоответствиеТипаПараметра = ПолучитьСоответствиеТипаПараметра();
	
	НоваяТаблицаОформления = ПустаяТаблицаОформления();  
	
	ДобавитьОсновныеЭлементыСтиля(НоваяТаблицаОформления, СоответствиеТипаПараметра); 
	ДобавитьОтображениеРамки(НоваяТаблицаОформления, СоответствиеТипаПараметра);
	
	Возврат НоваяТаблицаОформления;
	
КонецФункции

Функция ПустаяТаблицаОформления() 
	
	ТипыЗначения = Новый Массив;
	ТипыЗначения.Добавить(Тип("Цвет"));
	ТипыЗначения.Добавить(Тип("Шрифт"));
	ТипыЗначения.Добавить(Тип("Булево"));
	ТипыЗначения.Добавить(Тип("Строка"));
	ТипыЗначения.Добавить(Тип("Число"));
	ТипыЗначения.Добавить(Тип("ГоризонтальноеПоложение"));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Выбор", 		Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(25)));
	ПустаяТаблица.Колонки.Добавить("Параметр", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(25)));
	ПустаяТаблица.Колонки.Добавить("Значение", 		Новый ОписаниеТипов(ТипыЗначения));
	
	Возврат ПустаяТаблица;
	
КонецФункции

Процедура ДобавитьОсновныеЭлементыСтиля(ПустаяТаблица, СоответствиеТипаПараметра)  
	
	НоваяСтрока = ПустаяТаблица.Добавить();
	НоваяСтрока.Представление 	= "Цвет Фона";
	НоваяСтрока.Параметр		= "ЦветФона";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("ЦветФона");
	
	НоваяСтрока = ПустаяТаблица.Добавить(); 
	НоваяСтрока.Представление 	= "Цвет текста";
	НоваяСтрока.Параметр		= "ЦветТекста";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("ЦветТекста");
	
	НоваяСтрока = ПустаяТаблица.Добавить();
	НоваяСтрока.Представление 	= "Шрифт";
	НоваяСтрока.Параметр		= "Шрифт";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("Шрифт");

КонецПроцедуры  

Процедура ДобавитьЭлементыСтиляДляРеквизита(ПустаяТаблица, СоответствиеТипаПараметра)  
	
	НоваяСтрока = ПустаяТаблица.Добавить(); 
	НоваяСтрока.Представление 	= "Формат";
	НоваяСтрока.Параметр		= "Формат";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("Формат");

	НоваяСтрока = ПустаяТаблица.Добавить(); 
	НоваяСтрока.Представление 	= "Рамка";
	НоваяСтрока.Параметр		= "Рамка";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("Рамка");

	НоваяСтрока = ПустаяТаблица.Добавить(); 
	НоваяСтрока.Представление 	= "Горизонтальное положение";
	НоваяСтрока.Параметр		= "ГоризонтальноеПоложение";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("ГоризонтальноеПоложение");

КонецПроцедуры  

Процедура ДобавитьЭлементыСтиляДляГруппы(ПустаяТаблица, СоответствиеТипаПараметра)  
	
	
	//НоваяСтрока = ПустаяТаблица.Добавить(); 
	//НоваяСтрока.Представление = "Цвет текста заголовка";
	//НоваяСтрока.Параметр	  = "ЦветТекстаЗаголовка";
	//НоваяСтрока.Значение	  = СоответствиеТипаПараметра.получить("ЦветТекста");   
	//
	//НоваяСтрока = ПустаяТаблица.Добавить(); 
	//НоваяСтрока.Представление = "Шрифт заголовка";
	//НоваяСтрока.Параметр	  = "ШрифтЗаголовка";
	//НоваяСтрока.Значение	  = СоответствиеТипаПараметра.получить("Шрифт");   
	
КонецПроцедуры  

Процедура ДобавитьОтображениеЗаголовка(ПустаяТаблица, СоответствиеТипаПараметра)  
	
	НоваяСтрока = ПустаяТаблица.Добавить();
	НоваяСтрока.Представление 	= "Отображать заголовок";
	НоваяСтрока.Параметр		= "ОтображатьЗаголовок";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("ОтображатьЗаголовок");

КонецПроцедуры  

Процедура ДобавитьОтображениеРамки(ПустаяТаблица, СоответствиеТипаПараметра)  
	
	НоваяСтрока = ПустаяТаблица.Добавить();
	НоваяСтрока.Представление 	= "Рамка";
	НоваяСтрока.Параметр		= "Рамка";
	НоваяСтрока.Значение		= СоответствиеТипаПараметра.получить("Рамка");

КонецПроцедуры  

Функция ПолучитьСоответствиеТипаПараметра() Экспорт
	
	СоответствиеТипаПараметра = Новый Соответствие;
	СоответствиеТипаПараметра.Вставить("ЦветФона", 		Новый Цвет);
	СоответствиеТипаПараметра.Вставить("ЦветТекста", 	Новый Цвет);
	СоответствиеТипаПараметра.Вставить("Шрифт", 		Новый Шрифт);
	СоответствиеТипаПараметра.Вставить("Рамка", 		Ложь);
	СоответствиеТипаПараметра.Вставить("Формат", 		"");    
	СоответствиеТипаПараметра.Вставить("Ширина", 		0);    
	СоответствиеТипаПараметра.Вставить("ОтображатьЗаголовок", 		Истина);    
	СоответствиеТипаПараметра.Вставить("ГоризонтальноеПоложение", 	ГоризонтальноеПоложение.Авто);    
	
	Возврат СоответствиеТипаПараметра;
	
КонецФункции

Функция СоответствиеЭлементовГоризонтальногоПоложения() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ГоризонтальноеПоложение.Авто, 	ГоризонтальноеПоложениеЭлемента.Авто);
	Соответствие.Вставить(ГоризонтальноеПоложение.Лево, 	ГоризонтальноеПоложениеЭлемента.Лево);
	Соответствие.Вставить(ГоризонтальноеПоложение.Право, 	ГоризонтальноеПоложениеЭлемента.Право);
	Соответствие.Вставить(ГоризонтальноеПоложение.Центр, 	ГоризонтальноеПоложениеЭлемента.Центр);
	Соответствие.Вставить(ГоризонтальноеПоложение.ПоШирине, ГоризонтальноеПоложениеЭлемента.Центр);
	
	Возврат Соответствие;
	
КонецФункции

Процедура ФормаКлючевыхПоказателейНаНачальнойСтранце(Режим) Экспорт
	
	//Режим = Добавить(1), Отключить(0)   
	
	Если Режим = 1 Тогда
		ДобавитьФормуКлючевыхПоказателейНаНачальнойСтранце(); 
	КонецЕсли;
	Если Режим = 0 Тогда
		УдалитьФормуКлючевыхПоказателейНаНачальнойСтранце();		
	КонецЕсли;
	
	
КонецПроцедуры 

Процедура ДобавитьФормуКлючевыхПоказателейНаНачальнойСтранце() 
	
	Пользователь 		= ПользователиИнформационнойБазы.ТекущийПользователь();
	НастройкиНачальнойСтраницы 	= ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы",,,Пользователь.Имя);

	Если НастройкиНачальнойСтраницы = Неопределено Тогда
		НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
		СоставФорм = Новый СоставФормНачальнойСтраницы;
	Иначе
		СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	КонецЕсли; 
	
	ИмяФормыКлючевыхПоказателей = ИмяФормыКлючевыхПоказателей();
	
	СоставФорм.ПраваяКолонка.Добавить(ИмяФормыКлючевыхПоказателей);

	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",, НастройкиНачальнойСтраницы,, Пользователь.Имя);
	
КонецПроцедуры

Процедура УдалитьФормуКлючевыхПоказателейНаНачальнойСтранце()
	
	ИмяФормыКлючевыхПоказателей = ИмяФормыКлючевыхПоказателей();
	
	Пользователь 		= ПользователиИнформационнойБазы.ТекущийПользователь();
	НастройкиНачальнойСтраницы 	= ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы",,, Пользователь.Имя);
	Если НастройкиНачальнойСтраницы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	
	ИндексФормы = СоставФорм.ЛеваяКолонка.Найти(ИмяФормыКлючевыхПоказателей);
	Если ИндексФормы <> Неопределено Тогда
		СоставФорм.ЛеваяКолонка.Удалить(ИндексФормы);
	КонецЕсли;
	ИндексФормы = СоставФорм.ПраваяКолонка.Найти(ИмяФормыКлючевыхПоказателей);
	Если ИндексФормы <> Неопределено Тогда
		СоставФорм.ПраваяКолонка.Удалить(ИндексФормы);
	КонецЕсли;
	
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы",, НастройкиНачальнойСтраницы,, Пользователь.Имя);
	
КонецПроцедуры

Функция ТекущийРежимФормыКлючевыхПоказателейНаНачальнойСтранце() Экспорт

	//Режим = Добавить(1), Отключить(0)   
	
	ИмяФормыКлючевыхпоказателей = ИмяФормыКлючевыхпоказателей();
	Пользователь	= ПользователиИнформационнойБазы.ТекущийПользователь();
	
	НастройкиНачальнойСтраницы 	= ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиНачальнойСтраницы",,,Пользователь.Имя);
	Если НастройкиНачальнойСтраницы = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	СоставФорм = НастройкиНачальнойСтраницы.ПолучитьСоставФорм();
	
	ИндексФормыЛеваяКолонка = СоставФорм.ЛеваяКолонка.Найти(ИмяФормыКлючевыхпоказателей);
	ИндексФормыПраваяКолонка = СоставФорм.ПраваяКолонка.Найти(ИмяФормыКлючевыхпоказателей);
	Если ИндексФормыЛеваяКолонка <> Неопределено 
		или ИндексФормыПраваяКолонка <> Неопределено Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ИмяФормыКлючевыхПоказателей()
	
	Возврат "Обработка.CW_КлючевыеПоказатели.Форма.Форма";
	
КонецФункции

Функция ПолучитьСоответствиеИмениМакета() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Грузоперевозки", 			"CW_СхемаЖурналаГрузоперевозок");
	Соответствие.Вставить("Заказы", 					"CW_СхемаЖурналаЗаказов");
	Соответствие.Вставить("Заявки", 					"CW_СхемаЖурналаЗаявок"); 
	Соответствие.Вставить("ДебиторскаяЗадолженность", 	"CW_ОперативнаяДебиторскаяЗадолженность"); 
	
	Возврат Соответствие;
	
КонецФункции   

Функция ПолучитьСоответствиеИмениМакетаОтборуПоГруппеПользователя() Экспорт
	
	СтруктураДляГрузоперевозок = Новый Структура;
	СтруктураДляГрузоперевозок.Вставить("Используется", 		"ФильтрГрузоперевозок");
	СтруктураДляГрузоперевозок.Вставить("ХранилищеНастроек", 	"ХранилищеФильтраГрузоперевозок"); 
	
	СтруктураДляЗаказов = Новый Структура;
	СтруктураДляЗаказов.Вставить("Используется", 		"ФильтрЗаказов");
	СтруктураДляЗаказов.Вставить("ХранилищеНастроек", 	"ХранилищеФильтраЗаказов"); 
	
 	СтруктураДляЗаявок = Новый Структура;
	СтруктураДляЗаявок.Вставить("Используется", 		"ФильтрЗаявок");
	СтруктураДляЗаявок.Вставить("ХранилищеНастроек", 	"ХранилищеФильтраЗаявок"); 

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Грузоперевозки", СтруктураДляГрузоперевозок);
	Соответствие.Вставить("Заказы", 		СтруктураДляЗаказов);
	Соответствие.Вставить("Заявки", 		СтруктураДляЗаявок); 
	
	Возврат Соответствие;
	
КонецФункции

Процедура УстановитьИнтервалОбновленияДанных(Знач ИнтревалОбновления) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_НастройкиПользователей.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	ЗаписьРегистра.Прочитать();  
	
	Если Не ЗаписьРегистра.Выбран() Тогда
		Возврат;
	КонецЕсли;    
	
	ЗаписьРегистра.ИнтревалОбновленияКлючевыхПоказателей = ИнтревалОбновления;
	ЗаписьРегистра.Записать();

КонецПроцедуры

Функция ПолучитьГруппыСправочника() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиКлючевыхПоказателей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_НастройкиКлючевыхПоказателей КАК CW_НастройкиКлючевыхПоказателей
	|ГДЕ
	|	CW_НастройкиКлючевыхПоказателей.Владелец = &Владелец
	|	И CW_НастройкиКлючевыхПоказателей.ЭтоГруппа = ИСТИНА
	|	И CW_НастройкиКлючевыхПоказателей.ПометкаУдаления = ЛОЖЬ
	|	И CW_НастройкиКлючевыхПоказателей.НеИспользуется = ЛОЖЬ";   
	
	Запрос.УстановитьПараметр("Владелец", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура УстановитьПримерОформленияНаСервере(ОформляемыйЭлемент, ТаблицаОформления) Экспорт
	
	СоответствиеЭлементвСтиля = Новый Соответствие; 
	СоответствиеЭлементвСтиля.Вставить("ЦветТекста", "ЦветТекстаЗаголовка");
	СоответствиеЭлементвСтиля.Вставить("Шрифт",	     "ШрифтЗаголовка");
	
	СоответствиеЭлементовГоризонтальногоПоложения = CW_КлючевыеПоказателиСервер.СоответствиеЭлементовГоризонтальногоПоложения();	
	
	Для Каждого СтрокаОформления из ТаблицаОформления Цикл   
		
		ИмяЭлементаСтиля = СтрокаОформления.Параметр;
		
		НайденныйЭлемент = СоответствиеЭлементвСтиля.Получить(СтрокаОформления.Параметр); 
		Если НайденныйЭлемент <> Неопределено Тогда
			ИмяЭлементаСтиля = НайденныйЭлемент;
		КонецЕсли;
		
		Если ИмяЭлементаСтиля = "Рамка" Тогда   
			Если СтрокаОформления.Значение Тогда
				ОформляемыйЭлемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);	
			Иначе 
				ОформляемыйЭлемент.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);	
			КонецЕсли;
		ИначеЕсли ИмяЭлементаСтиля = "ОтображатьЗаголовок"    
			И ТипЗнч(ОформляемыйЭлемент) = Тип("ПолеФормы") Тогда
			Если СтрокаОформления.Значение Тогда
				ОформляемыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
			Иначе
				ОформляемыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Конецесли; 
		ИначеЕсли ИмяЭлементаСтиля = "ГоризонтальноеПоложение" Тогда   
			ОформляемыйЭлемент.ГоризонтальноеПоложение = СоответствиеЭлементовГоризонтальногоПоложения.Получить(СтрокаОформления.Значение);	
		Иначе
			ОформляемыйЭлемент[ИмяЭлементаСтиля] =  СтрокаОформления.Значение; 
			
			Если ТипЗнч(ОформляемыйЭлемент) = Тип("ПолеФормы")
				и НайденныйЭлемент <> Неопределено Тогда
				ОформляемыйЭлемент[СтрокаОформления.Параметр] =  СтрокаОформления.Значение; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
